import type { 制品规格书, 沐茵丝假发成品稿 } from "../../../shared/db/Db沐茵丝假发成品稿";
import { 假发类型 } from "../../../shared/db/Db沐茵丝假发成品稿";

export const 工艺说明Keys = [
  "作业方法",
  "整毛",
  "双针",
  "美容",
  "制帽",
  "手织",
  "高针",
  "完成",
  "包装",
] as const;

export const empty机器档位 = (): 制品规格书["机器规格清单"][number] =>
  ({
    档位: "",
    裁断与重量: [],
    整毛: { 拉尖: 0 },
    双针: { 毛长: 0, 尺数: { D: 0 }, 密度: 0 },
    美容: { 铝管: 0, 方向: "", 层数: 0 },
  }) as 制品规格书["机器规格清单"][number];

export const empty人工档位 = (): 制品规格书["人工规格清单"][number] => ({
  档位: "",
  裁断与重量: [],
  整毛: { 拉尖: 0 },
  双针: { 毛长: 0, 磅发: 0 },
  美容: { 铝管: 0 },
});

export const empty工艺说明 = (): 制品规格书["工艺说明"][number] => ({
  作业方法: "",
  整毛: "",
  双针: "",
  美容: "",
  制帽: "",
  手织: "",
  高针: "",
  完成: "",
  包装: "",
});

export const emptyFile = (): 沐茵丝假发成品稿 => ({
  _id: "",
  假发类型: 假发类型.纯色,
  客户编号: "",
  品名: "",
  原材料: "",
  CAP: "",
  头型图片: [],
  染色档位列表: [],
  制品规格书: {
    机器规格清单: [],
    人工规格清单: [],
    胶丝比例id: { 颜色编号: "", 发丝种类: "" },
    制帽: { 帽围: 0, 帽深: 0, 前后: 0, 唛头: "", 号码: "" },
    工艺说明: [],
    工程重量: {},
  },
  高针指示单: {
    注意事项: "",
    高针图: {
      底图: {
        svg: "",
        区域名: [],
        区域线条: [],
        文本节点: {},
      },
      自定义数据: { DML标注: [] },
    },
  },
  手织指示单: {
    注意事项: "",
    手织图: { svg: "" },
  },
});
